tutorials/Plate2D_2/Allrun
#!/bin/sh

cp -r initial 0
blockMesh
setFields
laserbeamFoam
